blog/2021/lc-20-valid-parentheses.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 13:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC20. 有效的括号</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC20. 有效的括号</h1>
</header><p>
今天思考 LeetCode 题目：有效的括号<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org2da5594" class="outline-2">
<h2 id="org2da5594">题目描述</h2>
<div class="outline-text-2" id="text-org2da5594">
<p>
给定一个只包括 <code>(</code> ， <code>)</code> ， <code>{</code> ， <code>}</code> ， <code>[</code> ， <code>]</code> 的字符串 <code>s</code> ，判断字符串是否有效。
</p>

<p>
有效字符串需满足：
</p>

<ol class="org-ol">
<li>左右括号类型相同</li>
<li>左右括号闭合顺序一致</li>
</ol>
</div>
</div>

<div id="outline-container-orga45f6d2" class="outline-2">
<h2 id="orga45f6d2">想法</h2>
<div class="outline-text-2" id="text-orga45f6d2">
<p>
一个只有以上 6 种字符的字符串组合，判断是否满足有效条件，可以采用双指针法，定义两个指向字符串开头和结尾的指针。
</p>

<ol class="org-ol">
<li>如果第一个位置是 <code>(</code> 那么最后一个一定是 <code>)</code> 。</li>
<li>采用循环迭代法</li>
</ol>
</div>
</div>

<div id="outline-container-org947bd7e" class="outline-2">
<h2 id="org947bd7e">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org947bd7e">
<p>
这道题目可以使用栈。栈的相关概念：先入后出、除头尾节点外，每个节点有一个前驱和一个后驱。
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {string} s</span>
<span style="color: #7c7565;"> * @return {boolean}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">var</span> <span style="color: #aaca86;">isValid</span> = <span style="color: #91a0b3;">function</span> (<span style="color: #aaca86;">s</span>) {
  <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">n</span> = s.length;
  <span style="color: #91a0b3;">if</span> (n % 2 === 1) {
    <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">false</span>;
  }
  <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">pairs</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Map</span>([
    <span style="color: #706565;">// </span><span style="color: #857575;">&#21704;&#24076;&#34920;</span>
    [<span style="color: #ddbc91;">")"</span>, <span style="color: #ddbc91;">"("</span>], <span style="color: #706565;">// </span><span style="color: #857575;">&#38190;&#20540;&#23545;</span>
    [<span style="color: #ddbc91;">"]"</span>, <span style="color: #ddbc91;">"["</span>],
    [<span style="color: #ddbc91;">"}"</span>, <span style="color: #ddbc91;">"{"</span>],
  ]);
  <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">stk</span> = []; <span style="color: #706565;">// </span><span style="color: #857575;">&#22534;&#26632;</span>
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">ch</span> of s) {
    <span style="color: #706565;">// </span><span style="color: #857575;">&#24490;&#29615;&#36845;&#20195;</span>
    <span style="color: #91a0b3;">if</span> (pairs.has(ch)) {
      <span style="color: #91a0b3;">if</span> (!stk.length || stk[stk.length - 1] !== pairs.get(ch)) {
        <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">false</span>;
      }
      stk.pop();
    } <span style="color: #91a0b3;">else</span> {
      stk.push(ch);
    }
  }
  <span style="color: #91a0b3;">return</span> !stk.length;
};
console.log(isValid(<span style="color: #ddbc91;">"]["</span>));
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/valid-parentheses/">https://leetcode-cn.com/problems/valid-parentheses/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/valid-parentheses/solution/you-xiao-de-gua-hao-by-leetcode-solution/">https://leetcode-cn.com/problems/valid-parentheses/solution/you-xiao-de-gua-hao-by-leetcode-solution/</a></p></div></div>


</div>
</div></div>
</body>
</html>